// 中文字符首字母映射
export const chineseMap = {
	'阿': 'A', '埃': 'A', '爱': 'A', '安': 'A', '奥': 'A', '澳': 'A',
	'巴': 'B', '白': 'B', '保': 'B', '北': 'B', '比': 'B', '波': 'B', '不': 'B',
	'朝': 'C', '赤': 'C', '刚': 'C', '中': 'C', '智': 'C', '捷': 'C',
	'丹': 'D', '德': 'D', '东': 'D',
	'俄': 'E',
	'法': 'F', '芬': 'F', '斐': 'F', '菲': 'F',
	'冈': 'G', '刚': 'G', '格': 'G', '哥': 'G', '古': 'G', '圭': 'G',
	'海': 'H', '韩': 'H', '荷': 'H', '黑': 'H', '洪': 'H', '匈': 'H',
	'几': 'J', '吉': 'J', '加': 'J', '柬': 'J', '捷': 'J', '津': 'J',
	'喀': 'K', '科': 'K', '克': 'K', '肯': 'K',
	'拉': 'L', '莱': 'L', '老': 'L', '黎': 'L', '立': 'L', '利': 'L', '列': 'L', '卢': 'L', '罗': 'L',
	'马': 'M', '毛': 'M', '美': 'M', '蒙': 'M', '孟': 'M', '秘': 'M', '密': 'M', '摩': 'M', '莫': 'M', '墨': 'M',
	'南': 'N', '瑙': 'N', '尼': 'N', '挪': 'N',
	'帕': 'P', '葡': 'P',
	'日': 'R', '瑞': 'R',
	'萨': 'S', '塞': 'S', '沙': 'S', '圣': 'S', '斯': 'S', '苏': 'S', '所': 'S',
	'塔': 'T', '泰': 'T', '坦': 'T', '汤': 'T', '特': 'T', '突': 'T', '图': 'T', '土': 'T',
	'瓦': 'W', '危': 'W', '委': 'W', '文': 'W', '乌': 'W',
	'西': 'X', '希': 'X', '新': 'X', '匈': 'X',
	'牙': 'Y', '亚': 'Y', '也': 'Y', '伊': 'Y', '意': 'Y', '印': 'Y', '英': 'Y', '约': 'Y', '以': 'Y', '越': 'Y',
	'赞': 'Z', '乍': 'Z', '智': 'Z', '中': 'Z'
};

// 国家/地区列表
export const countryList = [
	{ name: '阿尔巴尼亚', code: '+355' },
	{ name: '阿尔及利亚', code: '+213' },
	{ name: '阿富汗', code: '+93' },
	{ name: '阿根廷', code: '+54' },
	{ name: '阿根廷', code: '+54' },
	{ name: '爱尔兰', code: '+353' },
	{ name: '埃及', code: '+20' },
	{ name: '埃塞俄比亚', code: '+251' },
	{ name: '爱沙尼亚', code: '+372' },
	{ name: '阿拉伯联合酋长国', code: '+971' },
	{ name: '阿鲁巴', code: '+297' },
	{ name: '阿曼', code: '+968' },
	{ name: '澳大利亚', code: '+61' },
	{ name: '奥地利', code: '+43' },
	{ name: '巴西', code: '+55' },
	{ name: '比利时', code: '+32' },
	{ name: '波兰', code: '+48' },
	{ name: '丹麦', code: '+45' },
	{ name: '德国', code: '+49' },
	{ name: '俄罗斯', code: '+7' },
	{ name: '法国', code: '+33' },
	{ name: '芬兰', code: '+358' },
	{ name: '菲律宾', code: '+63' },
	{ name: '哥伦比亚', code: '+57' },
	{ name: '韩国', code: '+82' },
	{ name: '荷兰', code: '+31' },
	{ name: '加拿大', code: '+1' },
	{ name: '捷克', code: '+420' },
	{ name: '马来西亚', code: '+60' },
	{ name: '美国', code: '+1' },
	{ name: '墨西哥', code: '+52' },
	{ name: '南非', code: '+27' },
	{ name: '挪威', code: '+47' },
	{ name: '葡萄牙', code: '+351' },
	{ name: '日本', code: '+81' },
	{ name: '瑞典', code: '+46' },
	{ name: '瑞士', code: '+41' },
	{ name: '沙特阿拉伯', code: '+966' },
	{ name: '泰国', code: '+66' },
	{ name: '土耳其', code: '+90' },
	{ name: '乌克兰', code: '+380' },
	{ name: '西班牙', code: '+34' },
	{ name: '希腊', code: '+30' },
	{ name: '新加坡', code: '+65' },
	{ name: '匈牙利', code: '+36' },
	{ name: '意大利', code: '+39' },
	{ name: '印度', code: '+91' },
	{ name: '印度尼西亚', code: '+62' },
	{ name: '英国', code: '+44' },
	{ name: '越南', code: '+84' },
	{ name: '以色列', code: '+972' },
	{ name: '智利', code: '+56' },
	{ name: '中国', code: '+86' },
	{ name: '秘鲁', code: '+51' }
];

// 获取中文字符的首字母
export function getFirstLetter(str) {
	const firstChar = str.charAt(0);
	
	if (chineseMap[firstChar]) {
		return chineseMap[firstChar];
	}
	
	// 如果是英文字符，直接返回大写
	if (/[a-zA-Z]/.test(firstChar)) {
		return firstChar.toUpperCase();
	}
	
	// 其他情况返回 '#'
	return '#';
}


export const BASE_URL = 'http://101.126.145.3:8002'